[
  {
    "id": 1,
    "title": "Call For Papers",
    "location": "Tech tower",
    "price": "100 per person",
    "timing": "10:30 - 01:00 ",
    "description": "This competition provides a perfect platform for the students to come forward and be the leaders of future by demonstrating their creative and technical skills as well as their knowledge.Students will be presenting a topic on any emerging concepts, recent technological trends and development, which will help them in honoring skills for their technical future.",
    "imageId": "PaperPres",
    "notice": "topics are Open topic",
    "rules": [
      {
        "Team specifications": [
          "Maximum of 3 members per team.",
          "Each team must submit a soft copy of full paper on or before their presentation.",
          "Each team will have about 7 to 8 minutes for their presentation followed by 2 minutes questionnaire.",
          "Participants of a team can be of same or different colleges and of different teams also."
        ]
      }
    ],
    "link": "https://docs.google.com/forms/d/e/1FAIpQLScCrj9-GLvZk3jRXFLwKCvMPqFEu1P0Hy7Qby5OXa0F4hibkQ/viewform?usp=pp_url&entry.618272181=Call+for+papers+(Paper+Presentation)",
    "contacts": [
      {
        "name": "Rahul B",
        "number": 9080618420
      }
    ]
  },
  {
    "id": 2,
    "title": "CipherX",
    "location": "Tech tower lab-7",
    "timing": "10:30 - 11:45 ",
    "description": "Embrace the world of coding and debugging with open arms. Code is your canvas, bugs are your puzzles, and solutions are your creations. Welcome to the journey of digital problem-solving and innovation!!!",
    "notice": [
      "The students can either participate as an individual or as a team of two.",
      "There will be two rounds in total.",
      "The duration of the whole event is 1:30 hrs."
    ],
    "rules": [
      {
        "Debugging (Duration: 20 minutes only)": [
          "There will be a total of 20 codes to be debugged available in three languages namely: C, Java, Python as hard copy.",
          "Out of 20 codes, 10 will contain logical errors and remaining 10 will consist of syntax errors",
          "The students are provided system with internet connection and are encouraged to use any sources necessary to debug (no other electronic devices are allowed).",
          "Among total, half of participants will be promoted to next round by evaluating the debugged code and time complexity will be considered."
        ]
      },
      {
        "Coding (Duration: 40 minutes only)": [
          "Total of 5 problem statements will be provided.",
          "The problem statement will be from domains: [Sorting,Array manipulation,Searching,Pattern,String].",
          "The internet access will be denied for this round.",
          "The participates who provides output for any 3 of given statements will be announced as winner and runner up according to the time taken."
        ]
      }
    ],
    "link": "https://docs.google.com/forms/d/e/1FAIpQLScCrj9-GLvZk3jRXFLwKCvMPqFEu1P0Hy7Qby5OXa0F4hibkQ/viewform?usp=pp_url&entry.618272181=Cipherx+(coding+and+Debugging)",
    "imageId": "Coding&Debugging",
    "contacts": [
      {
        "name": "Fayaz",
        "number": 9392568989
      }
    ]
  },
  {
    "id": 3,
    "title": "Clash For Design",
    "location": "IV cse-B",
    "timing": "01:30 - 02:30",
    "notice": "A team can have Max of 3 MEMBERS, individual participation is also allowed",
    "imageId": "WebDev",
    "rules": [
      {
        "Rules & Regulations": [
          "Students can either participate as an individual or as a team",
          "The duration of whole event will be 1 hour (approximately)",
          "Participants must bring their own portable personal computer",
          "Each team will be allowed have a single laptop & a mobile phone (for internet connectivity)"
        ]
      },
      {
        "Round One": [
          "Participants will be provided with a design template",
          "Each team has to develop design within the given duration.",
          "Teams are limited to use HTML, CSS and JS",
          "Teams are strictly prohibited from copying codes from GitHub, stackoverflow, codepen, ChatGPT etc"
        ]
      }
    ],
    "link": "https://docs.google.com/forms/d/e/1FAIpQLScCrj9-GLvZk3jRXFLwKCvMPqFEu1P0Hy7Qby5OXa0F4hibkQ/viewform?usp=pp_url&entry.618272181=Clash+for+Design+(Web+Development)",
    "contacts": [
      {
        "name": "Riyaz",
        "number": 9629158073
      }
    ]
  },
  {
    "id": 4,
    "title": "Tech Quest",
    "location": "ECE",
    "timing": "11:45 - 12:45",
    "imageId": "Quix",
    "notice": [
      "A team can have Maximum TWO MEMBERS,INDIVIDUAL participation is also allowed.",
      "Teams must have a TEAM NAME for their identification.",
      "Electronic Gadgets should not be used anywhere until the 2nd round (online quiz round)."
    ],
    "rules": [
      {
        "Round 1": [
          "This round is aimed to screen the number of teams to maximum 15 for the next Quiz masters round.",
          "A question paper consisting of 20 questions will be given to each team of the technical quiz event.",
          "Time duration for this round is 15 minutes only.",
          "The top 15 teams from this round are eligible for the next round."
        ]
      },
      {
        "Round 2": [
          "This round is aimed to screen the number of teams to maximum 5 for the next Quiz masters round.",
          "A online quiz consisting of 15 questions will be displayed on the screen to each team of the technical quiz event.",
          "Time duration for this round is 15 seconds for each question ,the team must be quick enough to select the answers under the given duration of time i.e 15 secs for each question.",
          "Whichever team selects the right answers fast will be getting more points and that teams will be selected for the next round.",
          "The top 5 teams from this round are eligible for the next round."
        ]
      },
      {
        "Round 3": [
          "The final round is aimed to screen the Top 2 teams.",
          "A question paper consisting of 10 questions will be given to each team of the technical quiz event.",
          "Time duration for this round is 10 minutes only.",
          "There will be negative points for each incorrect answers.",
          "The top 2 teams will be determined based on the total points scored by each team."
        ]
      }
    ],
    "contacts": [{ "name": "Shafwan Ahmed", "number": 8072919646 }],
    "link": "https://docs.google.com/forms/d/e/1FAIpQLScCrj9-GLvZk3jRXFLwKCvMPqFEu1P0Hy7Qby5OXa0F4hibkQ/viewform?usp=pp_url&entry.618272181=Tech+Quest+(Technical+Quiz)"
  },
  {
    "id": 5,
    "title": "Link Masters",
    "location": "MBA seminar hall",
    "timing": "02:00 - 03:30",
    "imageId": "Connections",
    "notice": "Questions are related to non-technical only",
    "rules": [
      {
        "Rules": [
          "One team may contain a maximum of 3 members",
          "Image will be projected on the screen, Everyone should write the corresponding answers on the paper. After every round the paper will be collected and evaluated.",
          "Difficulty of the questions will be increased level by level.",
          "Number of rounds depends on the number of teams.",
          "Discussing with other teams is strictly not allowed.",
          "Using a mobile phone during the event is strictly prohibited.",
          "Someone seen breaking the rules will be disqualified.",
        ]
      }
    ],
    "link": "https://docs.google.com/forms/d/e/1FAIpQLScCrj9-GLvZk3jRXFLwKCvMPqFEu1P0Hy7Qby5OXa0F4hibkQ/viewform?usp=pp_url&entry.618272181=None&entry.1602371193=Link+Masters+(Connection)",
    "contacts": [
      {
        "name": "Rafique",
        "number": 9843988538
      }
    ]
  },
  {
    "id": 6,
    "title": "Light Camera Action",
    "imageId": "Shortfilm",
    "notice": "Both mobile and DSLR can be used to shoot the movie.",
    "timing": "ends at 02:30",
    "rules": [
      {
        "rules": [
          "the movie should not exceed 5 mins.",
          "the intro and end credits can take extra 60 sec.",
          "the movie should be unique and shouldn’t be extracted or copied from other works or social media.",
          "the entire movie should be based on the relevant concept.",
          "concept/theme are anti-drugs, social media awareness , horror or women",
          "movie should be submitted through pendrive/memory card on the day of symposium.",
          "while submitting the final output / movie, a video taken during the shoot i.e. behind the scenes video should be submitted.",
          "there is no limitations for number of cast and crew."
        ]
      }
    ],
    "link": "https://docs.google.com/forms/d/e/1FAIpQLScCrj9-GLvZk3jRXFLwKCvMPqFEu1P0Hy7Qby5OXa0F4hibkQ/viewform?usp=pp_url&entry.618272181=None&entry.1602371193=Lights+Camera+Action+(Movie+Making)",
    "contacts": [{ "name": "Bilal", "number": 6383071076 }]
  },
  {
    "id": 7,
    "title": "Flameless Food Fiesta",
    "price": "100 per person",
    "imageId": "cooking",
    "location": "EEE",
    "timing": "11:00 - 12:30",
    "notice": "Evaluation is based on the taste, hygiene & presentation",
    "rules": [
      {
        "rules": [
          "One team may contain a maximum of 3 members",
          "Total preparation time: 1 hour",
          "All required materials, tools, and equipment should be arranged by the participants",
          "Participants are required to be present 10 minutes prior to commencement at the venue",
          "Cutting of vegetables and fruits should be done on the spot. No prior preparation allowed",
          "Ready-made decorative items are not permitted",
          "Heating by any method is not permitted",
          "Participants should maintain cleanliness by all means and raw materials/prepared items should be hygienic",
          "Participants should clean their respective work places after the competition"
        ]
      }
    ],
    "link": "https://docs.google.com/forms/d/e/1FAIpQLScCrj9-GLvZk3jRXFLwKCvMPqFEu1P0Hy7Qby5OXa0F4hibkQ/viewform?usp=pp_url&entry.618272181=None&entry.1602371193=Flameless+Food+Fiesta+(Cooking+without+fire)",
    "contacts": [
      {
        "name": "Sandhiya",
        "number": 8072856125
      }
    ]
  },
  {
    "id": 8,
    "title": "Visual Art",
    "imageId": "Art",
    "location": "EEE",
    "timing": "01:30 - 02:30 ",
    "notice": "Express diverse themes, where your creativity knows no bounds",
    "rules": [
      {
        "rules": [
          "Every competitors will be given one hour for their art work.",
          "All the art works should be submitted within the allocated time.",
          "Competitors must bring the necessary tools for drawing and A3 size drawing paper will be provided.",
          "Formats like portrait, paintings, drawings are acceptable.",
          "Drawing paper or chart will be checked before starting the event.",
          "Competitor should not submit the plagiarized work (copied from someone else’s work (or) ideas).",
          "Any artwork that violates the rules and regulations won’t be considered."
        ]
      }
    ],
    "link": "https://docs.google.com/forms/d/e/1FAIpQLScCrj9-GLvZk3jRXFLwKCvMPqFEu1P0Hy7Qby5OXa0F4hibkQ/viewform?usp=pp_url&entry.618272181=None&entry.1602371193=Visual+Art+(Art)",
    "contacts": [{ "name": "T.L.Priyadharshinee", "number": 9361584559 }]
  },
  {
    "id": 9,
    "title": "Freeze Frame",
    "imageId": "photo",
    "timing": "ends at 02:30",
    "notice": "Photos should be uploaded to this email -> 'freezeframe2k23@gmail.com'",
    "rules": [
      {
        "rules": [
          "Photos should be uploaded to the email address provided below.",
          "Everyone must submit their photo within the given time.",
          "There should be a caption below the picture, mentioning the meaning of the photo.",
          "No DSLR camera should be used; you should only use the mobile camera.",
          "Photoshop or other software should not be used; you can do basic editing of the picture using the phone’s inbuilt editing options.",
          "There should be no watermarks or digital signatures on the picture.",
          "No irrelevant pictures should be uploaded.",
          "Pictures should be taken inside the campus and on the exact day of the event. Any picture taken before the event and yet submitted will be disqualified if found.",
          "If you fail to respond on time or violate any of the rules, you will be rejected or disqualified, and there will be no refund.",
          "Email to upload the pictures: freezeframe2k23@gmail.com"
        ]
      }
    ],
    "link": "https://docs.google.com/forms/d/e/1FAIpQLScCrj9-GLvZk3jRXFLwKCvMPqFEu1P0Hy7Qby5OXa0F4hibkQ/viewform?usp=pp_url&entry.618272181=None&entry.1602371193=Freeze+The+Frame+(+Photography)",
    "contacts": [{ "name": "Zaheer", "number": 9789399389 }]
  },
  {
    "id": 10,
    "title": "Controversy Clash",
    "location": "Mech",
    "timing": "10:30 - 11:30",
    "description": "Debate is a process that involves formal discussion and oral addresses on a particular topic or collection of topics, often with a moderator and an audience. In a debate, arguments are put forward for common opposing viewpoints.",
    "imageId": "ControversyClash",
    "notice": "Topic related to latest technological trend will be given on the spot.",
    "rules": [
      {
        "rules": [
          "Individual participants",
          "Based on the count of participants, members will be allotted to speak for and against the motion.",
          "At a time, a student will speak for the motion followed by the one against the motion. time allotted is 3 minutes.",
          "Then, the former and the latter will compete on the stage as rebuttal for which collectively they will be have 2 minutes.",
          "There will be negative marking for interjection.",
          "Use of any paper or guided reference will lead to disqualification.",
          "Criteria for Judgment are Content, Style of Delivery and Rebuttal"
        ]
      }
    ],
    "link": "https://docs.google.com/forms/d/e/1FAIpQLScCrj9-GLvZk3jRXFLwKCvMPqFEu1P0Hy7Qby5OXa0F4hibkQ/viewform?usp=pp_url&entry.618272181=None&entry.1602371193=Controversy+Clash+(Debate)",
    "contacts": [{ "name": "Vadepeer M", "number": 9585190687 }]
  },
  {
    "id": 11,
    "title": "Virtual War",
    "price": "30 for solo & 100 for squad",
    "imageId": "BGMI",
    "location": "MBA seminar",
    "timing": "11:00 - 12:30 ",
    "rules": [
      {
        "BGMI rules": [
          "people who have registered for BGMI will have to play 2 classic matches with their registered teammates.",
          "teams are responsible for their own technical issues.",
          "each teammates id must be more than level 30.",
          "each team leader should select their slot while registering.",
          "re-match can only be played with admin initiation.",
          "disconnects and lag issues will not qualify for a re-match."
        ]
      },
      {
        "freefire rules": [
          "Participants who have registered for Free Fire will need to play 2 Battle Royale matches with their registered teammates.",
          "All teams and players must be in the lobby of the given custom room and be ready, not later than 5 minutes before the match starts.",
          "Registered team members cannot be changed or replaced.",
          "Teams are responsible for their own technical issues.",
          "Each teammate's ID must be at least level 20.",
          "Each team leader should select their slot while registering.",
          "Re-matches can only be initiated by the admin.",
          "Disconnects and lag issues will not qualify for a re-match.",
          "DISCLAIMER: All decisions regarding the interpretation of these rules, player eligibility, scheduling of the tournament, and penalties for misconduct, rest solely with the Tournament Admin, the decisions of which are final.",
          "Rule Changes: These rules may be amended, modified, or supplemented by the Tournament Admin, from time to time, in order to ensure fair play and the integrity of the tournament."
        ]
      }
    ],
    "link": "https://docs.google.com/forms/d/e/1FAIpQLScCrj9-GLvZk3jRXFLwKCvMPqFEu1P0Hy7Qby5OXa0F4hibkQ/viewform?usp=pp_url&entry.618272181=None&entry.1602371193=BGMI&entry.1602371193=Freefire",
    "contacts": [
      {
        "name": "Lokesh (BGMI)",
        "number": 6382917112
      },
      {
        "name": "Praveen (FreeFire)",
        "number": 9080618420
      }
    ]
  },
  {
    "id": 11,
    "title": "Street Cricket",
    "location": "BasketBall coat",
    "timing": "10:30 - 3:30",
    "price":"200 per team",
    "imageId": "StreetCricket",
    "notice": "Maximum of 6 members per team",
    "rules": [
      {
        "rules": [
          "The team-head should register for the event on behalf of the team",
          "Umpire decision is final",
        ]
      }
    ],
    "link": "https://docs.google.com/forms/d/e/1FAIpQLScCrj9-GLvZk3jRXFLwKCvMPqFEu1P0Hy7Qby5OXa0F4hibkQ/viewform?usp=pp_url&entry.618272181=None&entry.1602371193=Street+Cricket",
    "contacts": [{ "name": "Thejas", "number": 9003829145 }]
  },
]
